In [1]:
import pandas as pd

In [7]:
# leyendo el archivo csv
df = pd.read_csv('StudentsPerformance.csv')

print("\033[1;34m" + "DATAFRAME" + "\033[0m\n")
df.head()

DATAFRAME

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Operaciones

## Operaciones en columnas

In [23]:
# Seleccionar una columna y calcular la suma total
print("\033[1;34m" + "SUMA" + "\033[0m")
print("\033[1;35m" + "Math Score" + "\033[0m")

df['math score'].sum()

SUMA
Math Score

66089

In [49]:
# Contar
# print("\033[1;34m" + "CONTAR" + "\033[0m")
df['math score'].count()

# Promedio
# print("\033[1;34m" + "PROMEDIO" + "\033[0m")
df['math score'].mean()

# Desv. estándar
# print("\033[1;34m" + "DESVIACIÓN ESTÁNDAR" + "\033[0m")
round(df['math score'].std(), 2)

# Máximo
# print("\033[1;34m" + "MÁXIMO" + "\033[0m")
df['math score'].max()

# Mínimo
print("\033[1;34m" + "MÍNIMO" + "\033[0m")
df['math score'].min()

MÍNIMO

0

In [53]:
# Calcular más rapido con .describe()
print("\033[1;34m" + "DESCRIBE()" + "\033[0m\n")
df.describe()

DESCRIBE()

       math score  reading score  writing score      average
count  1000.00000    1000.000000    1000.000000  1000.000000
mean     66.08900      69.169000      68.054000    67.770580
std      15.16308      14.600192      15.195657    14.257311
min       0.00000      17.000000      10.000000     9.000000
25%      57.00000      59.000000      57.750000    58.330000
50%      66.00000      70.000000      69.000000    68.330000
75%      77.00000      79.000000      79.000000    77.670000
max     100.00000     100.000000     100.000000   100.000000

## Operaciones en renglones

In [56]:
# Calcular la suma en una fila
print("\033[1;34m" + "SUMA" + "\033[0m")
total = df['math score'] + df['reading score'] + df['writing score']
total

SUMA

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [60]:
# Calcular el score promedio y asignar los resultados a una nueva columna
print("\033[1;34m" + "PROMEDIO" + "\033[0m")
df['average'] = round((df['math score'] + df['reading score'] + df['writing score']) / 3, 2)

PROMEDIO

In [43]:
# mostrar el dataframe
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.00
996,male,group C,high school,free/reduced,none,62,55,55,57.33
997,female,group C,high school,free/reduced,completed,59,71,65,65.00
998,female,group D,some college,standard,completed,68,78,77,74.33
999,female,group D,some college,free/reduced,none,77,86,86,83.00